{
	"Header.Item1": "About me",
	"Header.Item2": "Experience",
	"Header.Item3": "Work",
	"Header.Item4": "Testimonial",
	"Header.Item5": "Contact",
	"Header.cvBtn": "Resume",
	"Header.cvName": "caliel_Robles_Resume.pdf",
	"Banner.Pretitle": "Hello! My name is",
	"Banner.Description": "I'm a software engineer with <span class='underline'>over 5 years of experience</span>, specializing in developing systems, interfaces, bots, and technological solutions. I pride myself on my ability to translate project requirements into visually appealing and efficient solutions. Currently, I'm employed at <span class='underline'>RCG Global Services</span>, where I focus on building accessible, human-centered products.",
	"Banner.ActionBtn": "Get in touch",
	"AboutMe.Title": "About me",
	"AboutMe.Paragraphs": [
		"Hey there, I'm Florece Ann. I hold a Bachelor's Degree in Computer Science and currently exploring the world of  Mobile App Design and Development. Throughout my career, I've been involved in various large-scale projects, prioritizing responsive design, performance optimization, and cross-functional collaboration. I love turning a project's 'wish list' into something that not only looks great but also performs well.",
		"On a typical day, you'll find me working hand-in-hand with backend engineers on API integrations, turning designs into actual, clickable things, and squashing bugs with our QA team. I'm all about teamwork, taking ownership of what I do, and always looking for ways to help others grow in their roles, too.",
		"Some of the technologies that I have trained and worked on include (but are not limited to):"
	],
	"AboutMe.conclude": [
		"So that's a bit about me. Can't wait to bring my skills and passion to some more exciting projects!"
	],
	"Experience.Title": "Where I've Worked",
	"Experience.Jobs": [
		{
			"Tab": "Agência BrasilNet",
			"Title": "Wordpress Developer",
			"Date": "Julho 2022 - Presente",
			"Description": [
				"Construo Ecommerce e WebApps utilizando conhecimentos de front-end e, principalmente, wordpress",
				"Utilizo diversos plugins(Elementor, Woocommerce, JetElements etc) na construção de sites e Ecommerces"
			]
		},

		{
			"Tab": "TGOO Worldwide",
			"Title": "Front-end Developer",
			"Date": "Novembro 2023 - Dezembro 2023",
			"Description": [
				"Atuei na criação de componentes web para sites e Ecommerces, além de adquirir boa experiência em versionamento de codigo",
				"Utilizei HTML, CSS, JS e SCSS na construção dos componentes. Também utilizei algumas bibliotecas Jquery"
			]
		},
		{
			"Tab": "CoDev",
			"Title": "Web Developer",
			"Date": "January 2015 - January 2019",
			"Description": [
				"Learned Angular within 2-weeks to build new features for a SaaS enterprise software which provides language translation service and  programmed new quality checker application which received a patent",
				"Individually design, code, test, and deploy client’s Intouch Recovery Program website using PHP, HTML, jQuery, MySQL, and REST APIs",
				"Expanded solo team to nine members, which brought estimated $324,000 income per year to the Company",
				"Maintained and fixed production bugs for a Supply Chain Platform with 100M transactions"
			]
		},
		{
			"Tab": "Dynata",
			"Title": "PHP Developer",
			"Date": "July 2009 - January 2015",
			"Description": [
				"Programmed market research surveys for phone centers or the web",
				"Deployed daily at least 2 web or phone survey forms",
				"Programmed the real-time online reporting tool for the client and project management team"
			]
		}
	],
	"FeatureProjects.Title": "Some Things I've Built",
	"FeatureProjects.Label": "Featured Project",
	"FeatureProjects.Projects": [
		{
			"Title": "Disney Visa Card Promotion Page",
			"Description": "The website serves as a promotional platform for the Disney® Premier Visa® Card, a credit card tailored for fans of Disney and its associated brands. It offers an array of financial incentives and rewards aimed at enhancing the Disney experience for its cardholders. With a robust sign-up bonus, tiered rewards system, and exclusive member benefits, the site targets individuals planning Disney vacations or frequent expenditures on Disney-related products and services. The website aims to provide comprehensive information for potential customers, encapsulating everything from the card's utility for Disney vacations to its everyday use-cases. Overall, the project serves as a one-stop-shop for prospective cardholders to understand the card's financial and experiential benefits.",
			"imgs": [
				"assets/images/visa-card/disney1.png",
				"assets/images/visa-card/disney2.png",
				"assets/images/visa-card/disney3.png",
				"assets/images/visa-card/disney4.png",
				"assets/images/visa-card/disney5.png",
				"assets/images/visa-card/disney6.png"
			],
			"demoLink": "https://disneyworld.disney.go.com/visa-card/",
			"Technologies": [
				"HTML/HTML5",
				"CSS/CSS3",
				"LESS",
				"Angular",
				"AngularJS",
				"RxJS",
				"NodeJS",
				"Jenkins",
				"AWS",
				"Git",
				"Jira",
				"Figma",
				"Ultron"
			]
		},
		{
			"Title": "CoreBridge Software",
			"Description": "CoreBridge Software specializes in business management solutions that enhance efficiency and streamline operations. Offering tools for workflow automation, customer relationship management, and real-time analytics, the platform is designed for seamless integration and scalability. Suitable for businesses of all sizes, CoreBridge aims to empower organizations with data-driven decision-making and optimized processes.",
			"imgs": [
				"assets/images/corebridge/corebridge1.png",
				"assets/images/corebridge/corebridge2.png",
				"assets/images/corebridge/corebridge3.png",
				"assets/images/corebridge/corebridge4.png",
				"assets/images/corebridge/corebridge5.png",
				"assets/images/corebridge/corebridge6.png"
			],
			"demoLink": "https://corebridge.net/about-us/",
			"Technologies": [
				"HTML/HTML5",
				"CSS/CSS3",
				"LESS",
				"Angular",
				"Azure",
				"C#",
				".NET",
				"Entity Framework",
				"Bootstrap",
				"PrimeNG",
				"Git",
				"Jira",
				"Bitbucket",
				"Zeplin",
				"Figma"
			]
		},
		{
			"Title": " Kodaris Supply Chain Platform",
			"Description": "The Supply Chain Platform offers a robust set of features designed to streamline and optimize supply chain operations for both end-users and administrators. Users can easily shop for supplies, track their orders in real-time, and access valuable content through the integrated CMS. On the other hand, administrators benefit from a comprehensive dashboard that provides real-time analytics, stock inventory management, and user activity tracking. With functionalities ranging from demand forecasting and vendor management to reporting and analytics, the platform serves as a one-stop solution for businesses looking to improve their supply chain efficiency and customer satisfaction.",
			"imgs": [
				"assets/images/kodaris/kodaris1.png",
				"assets/images/kodaris/kodaris2.png",
				"assets/images/kodaris/kodaris3.png",
				"assets/images/kodaris/kodaris4.png"
			],
			"demoLink": "https://www.kodaris.com/",
			"Technologies": [
				"HTML",
				"CSS",
				"LESS",
				"Angular",
				"Angular Material",
				"Bootstrap",
				"Java",
				"Git",
				"Bitbucket"
			]
		},
		{
			"Title": "Lingotek Language Translation System",
			"Description": "The Document Translation and Review Application serves as a comprehensive platform for both automated and customized translation services. Users can upload their documents and choose between the platform's advanced auto-translate feature or opt for custom translation by assigned linguists. These linguists then proceed through various stages such as 'Translate,' 'Review,' and 'Custom,' and their work is subjected to peer voting and review to ensure quality and accuracy. Additionally, the application offers an automated review feature for contracts and deals in multiple languages, ensuring that vital contextual elements are neither omitted nor lost in translation. This multi-faceted approach makes the platform a robust solution for individuals and businesses with diverse translation and review needs.",
			"imgs": [
				"assets/images/lingotek/lingotek1.png",
				"assets/images/lingotek/lingotek2.png",
				"assets/images/lingotek/lingotek3.png",
				"assets/images/lingotek/lingotek4.png",
				"assets/images/lingotek/lingotek5.png",
				"assets/images/lingotek/lingotek6.jpeg"
			],
			"demoLink": "https://lingotek.com/",
			"Technologies": [
				"CoffeeScript",
				"AngularJS",
				"JQuery",
				"Jade/Pug",
				"Stylus",
				"Angular Material",
				"Webpack",
				"Git",
				"Bitbucket",
				"JIRA",
				"Docker",
				"Java",
				"NodeJS"
			]
		}
	],
	"OtherProjects.Title": "Other Noteworthy Projects",
	"OtherProjects.Projects": [
		{
			"Title": "Toronto Recycling Quiz App",
			"Description": "An ios quiz application about Recycling in Toronto. Allows user to pick their answer. View the result of the quiz. Allows multiple attempts until the user pass the quiz.",
			"ghLink": "https://github.com/annrobles/QuizApp",
			"demoLink": "https://github.com/annrobles/QuizApp",
			"Technologies": ["Swift", "iOS"]
		},
		{
			"Title": "Habit Tracker App",
			"Description": "An android habit tracker application, allows users to build a certain habit. User can track and update their habits. Users can also view leaderboard and community.",
			"ghLink": "https://github.com/annrobles/Habit-Tracker",
			"demoLink": "https://github.com/annrobles/Habit-Tracker",
			"Technologies": ["Android", "Java", "FireBase", "Google Cloud", "ROM"]
		}
	],
	"Contact.Pretitle": "What’s Next",
	"Contact.Title": "Get in touch!",
	"Contact.Content": "I will be happy to receive your contact if you want to talk about new opportunities. Write me, and I will reply as soon as I see your message. Simple one-page design that features a profile letter with basic information about a person.",
	"Contact.Btn": "Say Hello",
	"Testimonial.Title": "My clients' impressions of me",
	"Testimonial.Items": [
		{
			"Comment": "I just wanted to give you a personal <span class='underline'>thank you for the years of service and dedication to CoDev</span>.  I understand that you are leaving to pursue an educational opportunity, and while I am <span class='underline'>sad to see you go</span>, I respect your effort to enhance your skills. I do sincerely hope that you consider returning to CoDev when your educational opportunities allow it, and I hope you stay in touch with the team locally, as well with me. If there is anything I can do to help you out, let me know.",
			"Name": "Tony Morrison",
			"Position": "CEO",
			"Company": "CoDev",
			"img": "assets/images/testimonial/tony-morrison.jpeg"
		},
		{
			"Comment": "Florece is a <span class='underline'>driven self-starter</span> whom I have relied on to <span class='underline'>lead the front-end development effort for her team</span>. For the past several years, she has been diving into our challenging problems and finding ways to solve them, <span class='underline'>always putting in the time necessary to get to the right solutions</span>. Specifically, she has <span class='underline'>built innovative</span> tools to help our users translate content between languages, which brings challenges that require understanding internationalization and localization best practices, especially as they relate to web applications. She has <span class='underline'>never shied away from learning new technologies and frameworks</span>, and I am confident she will help push any development effort across the finish line. <span class='underline'>I give her my unqualified recommendation</span>!",
			"Name": "Robert Bailey",
			"Position": "Director of Software Engineering",
			"Company": "Lingotek",
			"img": "assets/images/testimonial/robert-bailey.jpeg"
		},
		{
			"Comment": "5/5 stars. She does not hesitate to call meetings and ask questions essential to move the team forward. She <span class='underline'>does not waste any time</span> to call the attention of her teammates to make sure everyone is on board. More often than not we find <span class='underline'>her team’s Jira board running low on tickets</span>. Shows <span class='underline'>great leadership</span> for Forza. Available for pairing and code reviews. Has a great understanding of team expectations, objectives, and output. Checks in with PM about team needs, such as additional work, and issues, such as team frictions and/or morale issues.",
			"Name": "Tori Blount",
			"Position": "Project Manager",
			"Company": "CoreBridge",
			"img": "assets/images/testimonial/tori-blount.png"
		}
	]
}
